espressif/esp-idf/components/soc/esp32h4/include/modem/modem_lpcon_reg.h
/* MODEM_LPCON_MEM_CONF_REG register*/
#define MODEM_LPCON_MEM_CONF_REG (DR_REG_MODEM_LPCON_BASE + 0x2c)
/* MODEM_LPCON_DC_MEM_MODE : R/W; bitpos: [2:0]; default: 0;*/
#define MODEM_LPCON_DC_MEM_MODE    0x00000007U
#define MODEM_LPCON_DC_MEM_MODE_M  (MODEM_LPCON_DC_MEM_MODE_V << MODEM_LPCON_DC_MEM_MODE_S)
#define MODEM_LPCON_DC_MEM_MODE_V  0x00000007U
#define MODEM_LPCON_DC_MEM_MODE_S  0
/* MODEM_LPCON_DC_MEM_FORCE : R/W; bitpos: [3]; default: 1;*/
#define MODEM_LPCON_DC_MEM_FORCE    (BIT(3))
#define MODEM_LPCON_DC_MEM_FORCE_M  (MODEM_LPCON_DC_MEM_FORCE_V << MODEM_LPCON_DC_MEM_FORCE_S)
#define MODEM_LPCON_DC_MEM_FORCE_V  0x00000001U
#define MODEM_LPCON_DC_MEM_FORCE_S  3
/* MODEM_LPCON_AGC_MEM_MODE : R/W; bitpos: [6:4]; default: 0;*/
#define MODEM_LPCON_AGC_MEM_MODE    0x00000007U
#define MODEM_LPCON_AGC_MEM_MODE_M  (MODEM_LPCON_AGC_MEM_MODE_V << MODEM_LPCON_AGC_MEM_MODE_S)
#define MODEM_LPCON_AGC_MEM_MODE_V  0x00000007U
#define MODEM_LPCON_AGC_MEM_MODE_S  4
/* MODEM_LPCON_AGC_MEM_FORCE : R/W; bitpos: [7]; default: 1;*/
#define MODEM_LPCON_AGC_MEM_FORCE    (BIT(7))
#define MODEM_LPCON_AGC_MEM_FORCE_M  (MODEM_LPCON_AGC_MEM_FORCE_V << MODEM_LPCON_AGC_MEM_FORCE_S)
#define MODEM_LPCON_AGC_MEM_FORCE_V  0x00000001U
#define MODEM_LPCON_AGC_MEM_FORCE_S  7
/* MODEM_LPCON_PBUS_MEM_MODE : R/W; bitpos: [10:8]; default: 0;*/
#define MODEM_LPCON_PBUS_MEM_MODE    0x00000007U
#define MODEM_LPCON_PBUS_MEM_MODE_M  (MODEM_LPCON_PBUS_MEM_MODE_V << MODEM_LPCON_PBUS_MEM_MODE_S)
#define MODEM_LPCON_PBUS_MEM_MODE_V  0x00000007U
#define MODEM_LPCON_PBUS_MEM_MODE_S  8
/* MODEM_LPCON_PBUS_MEM_FORCE : R/W; bitpos: [11]; default: 1;*/
#define MODEM_LPCON_PBUS_MEM_FORCE    (BIT(11))
#define MODEM_LPCON_PBUS_MEM_FORCE_M  (MODEM_LPCON_PBUS_MEM_FORCE_V << MODEM_LPCON_PBUS_MEM_FORCE_S)
#define MODEM_LPCON_PBUS_MEM_FORCE_V  0x00000001U
#define MODEM_LPCON_PBUS_MEM_FORCE_S  11
/* MODEM_LPCON_BC_MEM_MODE : R/W; bitpos: [14:12]; default: 0;*/
#define MODEM_LPCON_BC_MEM_MODE    0x00000007U
#define MODEM_LPCON_BC_MEM_MODE_M  (MODEM_LPCON_BC_MEM_MODE_V << MODEM_LPCON_BC_MEM_MODE_S)
#define MODEM_LPCON_BC_MEM_MODE_V  0x00000007U
#define MODEM_LPCON_BC_MEM_MODE_S  12
/* MODEM_LPCON_BC_MEM_FORCE : R/W; bitpos: [15]; default: 1;*/
#define MODEM_LPCON_BC_MEM_FORCE    (BIT(15))
#define MODEM_LPCON_BC_MEM_FORCE_M  (MODEM_LPCON_BC_MEM_FORCE_V << MODEM_LPCON_BC_MEM_FORCE_S)
#define MODEM_LPCON_BC_MEM_FORCE_V  0x00000001U
#define MODEM_LPCON_BC_MEM_FORCE_S  15
/* MODEM_LPCON_I2C_MST_MEM_MODE : R/W; bitpos: [18:16]; default: 0;*/
#define MODEM_LPCON_I2C_MST_MEM_MODE    0x00000007U
#define MODEM_LPCON_I2C_MST_MEM_MODE_M  (MODEM_LPCON_I2C_MST_MEM_MODE_V << MODEM_LPCON_I2C_MST_MEM_MODE_S)
#define MODEM_LPCON_I2C_MST_MEM_MODE_V  0x00000007U
#define MODEM_LPCON_I2C_MST_MEM_MODE_S  16
/* MODEM_LPCON_I2C_MST_MEM_FORCE : R/W; bitpos: [19]; default: 1;*/
#define MODEM_LPCON_I2C_MST_MEM_FORCE    (BIT(19))
#define MODEM_LPCON_I2C_MST_MEM_FORCE_M  (MODEM_LPCON_I2C_MST_MEM_FORCE_V << MODEM_LPCON_I2C_MST_MEM_FORCE_S)
#define MODEM_LPCON_I2C_MST_MEM_FORCE_V  0x00000001U
#define MODEM_LPCON_I2C_MST_MEM_FORCE_S  19
/* MODEM_LPCON_CHAN_FREQ_MEM_MODE : R/W; bitpos: [22:20]; default: 0;*/
#define MODEM_LPCON_CHAN_FREQ_MEM_MODE    0x00000007U
#define MODEM_LPCON_CHAN_FREQ_MEM_MODE_M  (MODEM_LPCON_CHAN_FREQ_MEM_MODE_V << MODEM_LPCON_CHAN_FREQ_MEM_MODE_S)
#define MODEM_LPCON_CHAN_FREQ_MEM_MODE_V  0x00000007U
#define MODEM_LPCON_CHAN_FREQ_MEM_MODE_S  20
/* MODEM_LPCON_CHAN_FREQ_MEM_FORCE : R/W; bitpos: [23]; default: 1;*/
#define MODEM_LPCON_CHAN_FREQ_MEM_FORCE    (BIT(23))
#define MODEM_LPCON_CHAN_FREQ_MEM_FORCE_M  (MODEM_LPCON_CHAN_FREQ_MEM_FORCE_V << MODEM_LPCON_CHAN_FREQ_MEM_FORCE_S)
#define MODEM_LPCON_CHAN_FREQ_MEM_FORCE_V  0x00000001U
#define MODEM_LPCON_CHAN_FREQ_MEM_FORCE_S  23

/* MODEM_LPCON_MEM_RF1_AUX_CTRL_REG register*/
#define MODEM_LPCON_MEM_RF1_AUX_CTRL_REG (DR_REG_MODEM_LPCON_BASE + 0x30)
/* MODEM_LPCON_MODEM_PWR_RF1_AUX_CTRL : R/W; bitpos: [31:0]; default: 10320;*/
#define MODEM_LPCON_MODEM_PWR_RF1_AUX_CTRL    0xFFFFFFFFU
#define MODEM_LPCON_MODEM_PWR_RF1_AUX_CTRL_M  (MODEM_LPCON_MODEM_PWR_RF1_AUX_CTRL_V << MODEM_LPCON_MODEM_PWR_RF1_AUX_CTRL_S)
#define MODEM_LPCON_MODEM_PWR_RF1_AUX_CTRL_V  0xFFFFFFFFU
#define MODEM_LPCON_MODEM_PWR_RF1_AUX_CTRL_S  0

/* MODEM_LPCON_MEM_RF2_AUX_CTRL_REG register*/
#define MODEM_LPCON_MEM_RF2_AUX_CTRL_REG (DR_REG_MODEM_LPCON_BASE + 0x34)
/* MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL : R/W; bitpos: [31:0]; default: 0;*/
#define MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL    0xFFFFFFFFU
#define MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_M  (MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_V << MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_S)
#define MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_V  0xFFFFFFFFU
#define MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_S  0

/* MODEM_LPCON_APB_MEM_SEL_REG register*/
#define MODEM_LPCON_APB_MEM_SEL_REG (DR_REG_MODEM_LPCON_BASE + 0x38)
/* MODEM_LPCON_CHAN_FREQ_MEM_EN : R/W; bitpos: [0]; default: 0;*/
#define MODEM_LPCON_CHAN_FREQ_MEM_EN    (BIT(0))
#define MODEM_LPCON_CHAN_FREQ_MEM_EN_M  (MODEM_LPCON_CHAN_FREQ_MEM_EN_V << MODEM_LPCON_CHAN_FREQ_MEM_EN_S)
#define MODEM_LPCON_CHAN_FREQ_MEM_EN_V  0x00000001U
#define MODEM_LPCON_CHAN_FREQ_MEM_EN_S  0
/* MODEM_LPCON_PBUS_MEM_EN : R/W; bitpos: [1]; default: 0;*/
#define MODEM_LPCON_PBUS_MEM_EN    (BIT(1))
#define MODEM_LPCON_PBUS_MEM_EN_M  (MODEM_LPCON_PBUS_MEM_EN_V << MODEM_LPCON_PBUS_MEM_EN_S)
#define MODEM_LPCON_PBUS_MEM_EN_V  0x00000001U
#define MODEM_LPCON_PBUS_MEM_EN_S  1
/* MODEM_LPCON_AGC_MEM_EN : R/W; bitpos: [2]; default: 0;*/
#define MODEM_LPCON_AGC_MEM_EN    (BIT(2))
#define MODEM_LPCON_AGC_MEM_EN_M  (MODEM_LPCON_AGC_MEM_EN_V << MODEM_LPCON_AGC_MEM_EN_S)
#define MODEM_LPCON_AGC_MEM_EN_V  0x00000001U
#define MODEM_LPCON_AGC_MEM_EN_S  2
/* MODEM_LPCON_PWR_MEM_BASE : R/W; bitpos: [18:3]; default: 0;*/
#define MODEM_LPCON_PWR_MEM_BASE    0x0000FFFFU
#define MODEM_LPCON_PWR_MEM_BASE_M  (MODEM_LPCON_PWR_MEM_BASE_V << MODEM_LPCON_PWR_MEM_BASE_S)
#define MODEM_LPCON_PWR_MEM_BASE_V  0x0000FFFFU
#define MODEM_LPCON_PWR_MEM_BASE_S  3

