espressif/esp-idf/components/soc/esp32h4/include/modem/modem_lpcon_reg.h
/* MODEM_LPCON_DCMEM_VALID_0_REG register*/
#define MODEM_LPCON_DCMEM_VALID_0_REG (DR_REG_MODEM_LPCON_BASE + 0x3c)
/* MODEM_LPCON_DCMEM_VALID_0 : RO; bitpos: [31:0]; default: 0;*/
#define MODEM_LPCON_DCMEM_VALID_0    0xFFFFFFFFU
#define MODEM_LPCON_DCMEM_VALID_0_M  (MODEM_LPCON_DCMEM_VALID_0_V << MODEM_LPCON_DCMEM_VALID_0_S)
#define MODEM_LPCON_DCMEM_VALID_0_V  0xFFFFFFFFU
#define MODEM_LPCON_DCMEM_VALID_0_S  0

/* MODEM_LPCON_DCMEM_VALID_1_REG register*/
#define MODEM_LPCON_DCMEM_VALID_1_REG (DR_REG_MODEM_LPCON_BASE + 0x40)
/* MODEM_LPCON_DCMEM_VALID_1 : RO; bitpos: [31:0]; default: 0;*/
#define MODEM_LPCON_DCMEM_VALID_1    0xFFFFFFFFU
#define MODEM_LPCON_DCMEM_VALID_1_M  (MODEM_LPCON_DCMEM_VALID_1_V << MODEM_LPCON_DCMEM_VALID_1_S)
#define MODEM_LPCON_DCMEM_VALID_1_V  0xFFFFFFFFU
#define MODEM_LPCON_DCMEM_VALID_1_S  0

/* MODEM_LPCON_DCMEM_VALID_2_REG register*/
#define MODEM_LPCON_DCMEM_VALID_2_REG (DR_REG_MODEM_LPCON_BASE + 0x44)
/* MODEM_LPCON_DCMEM_VALID_2 : RO; bitpos: [31:0]; default: 0;*/
#define MODEM_LPCON_DCMEM_VALID_2    0xFFFFFFFFU
#define MODEM_LPCON_DCMEM_VALID_2_M  (MODEM_LPCON_DCMEM_VALID_2_V << MODEM_LPCON_DCMEM_VALID_2_S)
#define MODEM_LPCON_DCMEM_VALID_2_V  0xFFFFFFFFU
#define MODEM_LPCON_DCMEM_VALID_2_S  0

/* MODEM_LPCON_DCMEM_VALID_3_REG register*/
#define MODEM_LPCON_DCMEM_VALID_3_REG (DR_REG_MODEM_LPCON_BASE + 0x48)
/* MODEM_LPCON_DCMEM_VALID_3 : RO; bitpos: [31:0]; default: 0;*/
#define MODEM_LPCON_DCMEM_VALID_3    0xFFFFFFFFU
#define MODEM_LPCON_DCMEM_VALID_3_M  (MODEM_LPCON_DCMEM_VALID_3_V << MODEM_LPCON_DCMEM_VALID_3_S)
#define MODEM_LPCON_DCMEM_VALID_3_V  0xFFFFFFFFU
#define MODEM_LPCON_DCMEM_VALID_3_S  0

/* MODEM_LPCON_DATE_REG register*/
#define MODEM_LPCON_DATE_REG (DR_REG_MODEM_LPCON_BASE + 0x4c)
/* MODEM_LPCON_DATE : R/W; bitpos: [27:0]; default: 37823024;*/
#define MODEM_LPCON_DATE    0x0FFFFFFFU
#define MODEM_LPCON_DATE_M  (MODEM_LPCON_DATE_V << MODEM_LPCON_DATE_S)
#define MODEM_LPCON_DATE_V  0x0FFFFFFFU
#define MODEM_LPCON_DATE_S  0

#ifdef __cplusplus
}
#endif
